example.yml
# Emulate 20 publishers sending two records per second
# for 60 seconds.
config:
  target: "https://sqs.us-east-1.amazonaws.com/012345678901/my-queue"
  sqs:
    region: "us-east-1"
  phases:
    - arrivalCount: 10
      duration: 1
  engines:
    sqs: {}

scenarios:
  - name: "Send to queue"
    engine: sqs
    flow:
      - count: 60
        loop:
        - sendMessage:
            messageBody:
              eventType: "view"
              objectId: "ba0ec3de-26fe-4874-a74d-b72527160278"
              timestamp: 1492975372004
              location: "London, UK"
        - sendMessage:
            messageBody:
              eventType: "view"
              objectId: "ff0ed9de-26be-7654-f90c-b974117161954"
              timestamp: 1492975372004
              location: "London, UK"
        - think: 1